app/Controllers/System/ToolMasterController.php

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '61'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT `tool_id`, `tool_created_on`, `tool_description`, `tool_images`, `tool_rent_quantity`, `tool_sale_quantity`, `tool_total_quantity`, `tool_name`, `tool_rent_id`, `tool_deposit_id`, `tool_deposit_price`, `tool_adv_payment`, `tool_adv_price`, `tool_cost`, `tool_rent_cost`
FROM `tool_details`
WHERE `tool_delete_flag` = 0
---
    public function index()
    {
        // return $this->fail("invalid user", 400);
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }


        $ToolDetailsModel = new ToolDetailsModel();
        $tool_list = $ToolDetailsModel
        ->select('tool_id,
                 tool_created_on,
                 tool_description,
                 tool_images,
                 tool_rent_quantity,
                 tool_sale_quantity,
                 tool_total_quantity,
                 tool_name,
                 tool_rent_id,
                 tool_deposit_id,
                 tool_deposit_price,
                 tool_adv_payment,
                 tool_adv_price,
                 tool_cost,
                 tool_rent_cost')
        ->where('tool_delete_flag', 0)->get()->getResult();