app/Controllers/System/UserMasterController.php

SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `users`
JOIN `user_roles` ON `role_Id`=`us_role_id`
ORDER BY `us_id` DESC
---
    public function index()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }
        $response['ret_data'] = 'error';
        $usermastermodel = new UsersModel();
        $user_list = $usermastermodel
            ->join('user_roles', 'role_Id=us_role_id')
            ->orderBy('us_id', 'desc')
            ->findAll();

SELECT *
FROM `users`
JOIN `user_roles` ON `role_Id`=`us_role_id`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `servicerequest_master`
JOIN `status_master` ON `sm_id`=`serm_status`
WHERE `serm_vendor_flag` = 0
AND `serm_assigne` = '1'
---
    public function get_userdet()
    {


        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->join('user_roles', 'role_Id=us_role_id')->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }

        $usermastermodel = new UsersModel();
        $servicerequestmasterModel = new ServiceRequestMasterModel();
        $toolrequestmasterModel = new ToolRequestDetailsModel();
        $workcardsettingsModel = new WorkCardSettingsModel();

        $active_serv = $servicerequestmasterModel
            ->where('serm_vendor_flag', 0)
            ->where('serm_assigne', $tokendata['uid'])
            ->join('status_master', 'sm_id=serm_status')->findAll();