app/Controllers/WorkCard/WorkCardMasterController.php

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function getworkcard_Details()
    {

        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
---
    public function servicestatus_update()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();

INSERT INTO `notification_master` (`nt_sourceid`, `nt_destid`, `nt_req_number`, `nt_request_type`, `nt_sourcetype`, `nt_type`, `nt_type_id`, `nt_header`, `nt_content`, `nt_created_on`) VALUES ('1', '61', 'RAMS_SR286', 0, 1, 0, '122', 'Work Card Updated!!!', 'Work card has been updated for - RAMS_SR286. Tap to see', '2024-08-28 15:25:35')
---
                    'nt_content' => $custcontent,
                    'nt_created_on' => $date
                ];
                $notificationmasterModel->insert($notif_data);

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT `serm_id`, `serm_status`, `serm_number`, `serm_vendor_flag`
FROM `servicerequest_master`
JOIN `status_master` ON `sm_id`=`serm_status`
WHERE `serm_deleteflag` = 0
AND `serm_active_flag` = 0
AND `serm_status` IN (27,28)
AND `serm_custid` = '1'
ORDER BY `serm_id` DESC
---
    public function work_card_activity_details()

    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }
        $serequestModel = new ServiceRequestMasterModel();
        $workcardItemsModel = new ServiceRequestItemsModel();
        $result = $serequestModel
            ->select('serm_id,serm_status,serm_number,serm_vendor_flag')
            ->where('serm_deleteflag', 0)
            ->where('serm_active_flag', 0)
            ->whereIn('serm_status', [27, 28])
            ->where('serm_custid', $tokendata['uid'])
            ->join('status_master', 'sm_id=serm_status')
            ->orderBy('serm_id', 'desc')
            ->findAll();