app/Controllers/Customer/CustomersubUsersController.php

    public function subuser_login()
    {

        $model = new CustomersubUsersModel();
        $common = new Commonutils();
        $featureroleModel = new FeatureMappingModel();

        $rules = [
            'email' => 'required',
            'password' => 'required',
        ];

        if (!$this->validate($rules))
            return $this->fail($this->validator->getErrors());

        $res = $model->where('csub_email', $this->request->getVar('email'))->first();

        if (!$res) {
            $response = [
                'ret_data' => 'fail',

            ];
            return $this->respond($response, 200);
        } else {

            $encrypter = \Config\Services::encrypter();
            $builder = $this->db->table('system_datas');
            $builder->select('encryption_key');
            $query = $builder->get();
---
SELECT *
FROM `customer_subusers`
WHERE `csub_email` = 'abyjose@gmail.com'
 LIMIT 1
SELECT `encryption_key`
FROM `system_datas`