app/Controllers/Vendor/VendorMasterController.php

SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `customer_master`
WHERE `cstm_delete_flag` = 0
AND `cstm_vendor_flag` = 1
---
    public function index()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }
        $customermastermodel = new CustomerMasterModel();
        $ServiceRequestMasterModel = new ServiceRequestMasterModel();
        $vendorMasterModel = new VendorModel();
        $servicerequestitemsModel = new ServiceRequestItemsModel();

        $cust_list = $customermastermodel
            ->where('cstm_delete_flag', 0)
            ->where('cstm_vendor_flag', 1)
            ->findAll();

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function show($id = null)
    {

        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `request_payment_tracker`
WHERE `rpt_type` = 1
AND `rpt_reqt_id` = '78'
 LIMIT 1
SELECT *
FROM `request_payment_history`
WHERE `rph_type` = 0
AND `rph_rq_id` = '78'
 LIMIT 1
---
            ->orderBy('vm_updated_on', 'desc')
            ->first();

        $rpt_data = $paymenttrackerModel->where('rpt_type', 1)->where('rpt_reqt_id', base64_decode($id))->first();
        $rpt_hist = $paymenthistoryModel->where('rph_type', 0)->where('rph_rq_id', base64_decode($id))->first();

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function vend_serm_list()
    {

        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `servicerequest_items`
WHERE `sitem_deleteflag` = 0
AND `sitem_serid` = '117'
ORDER BY `sitem_id` DESC
---
        if (sizeof($result) > 0) {
            for ($j = 0; $j < sizeof($result); $j++) {

                $result[$j]['services'] = $result[$j]['vm_status'] != 0 ? $servicerequestitemsModels->where('sitem_deleteflag', 0)
                    ->where('sitem_serid', $result[$j]['serm_id'])
                    ->orderBy('sitem_id', 'DESC')
                    ->findAll() : [];

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function vendorcompleted_requestbyid()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `quote_master`
JOIN `customer_master` ON `cstm_id`=`qtm_custid`
JOIN `servicerequest_master` ON `serm_id`=`qtm_serm_id`
JOIN `customer_vehicle` ON `custveh_id` =`serm_vehid`
JOIN `cat_vehicle_data` ON `id`=`customer_vehicle`.`custveh_veh_id`
LEFT JOIN `vendor_master` ON `vm_serm_id`=`serm_id`
WHERE `qtm_delete_flag` = 0
AND `qtm_serm_id` = '115'
AND `qtm_type` = 0
ORDER BY `qtm_created_on` DESC
 LIMIT 1
---
    public function vquote_details()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }



        $quotemodel = new QuoteMasterModel();
        $quoteitemsmodel = new QuoteItemsModel();
        $customerdiscountModel = new CustomerDiscountModel();

        $result = [];
        $result = $quotemodel->where('qtm_delete_flag', 0)->where('qtm_serm_id',  $this->request->getVar("request_id"))
            ->where('qtm_type', 0)
            ->join('customer_master', 'cstm_id=qtm_custid')
            ->join('servicerequest_master', 'serm_id=qtm_serm_id')
            ->join('customer_vehicle', 'custveh_id =serm_vehid')
            ->join('cat_vehicle_data', 'id=customer_vehicle.custveh_veh_id')
            ->join('vendor_master', 'vm_serm_id=serm_id', 'left')
            ->orderBy('qtm_created_on', 'desc')
            ->first();

SELECT *
FROM `servicerequest_items`
JOIN `servicerequest_master` ON `serm_id`=`sitem_serid`
JOIN `customer_master` ON `cstm_id`=`serm_custid`
JOIN `customer_vehicle` ON `custveh_id` =`serm_vehid`
JOIN `cat_vehicle_data` ON `id`=`custveh_veh_id`
JOIN `status_master` ON `sm_id`=`serm_status`
WHERE `sitem_deleteflag` = 0
AND `sitem_assignee_type` = 1
AND `sitem_assignee` = '1'
ORDER BY `sitem_id` DESC
SELECT *
FROM `servicerequest_media`
WHERE `smedia_deleteflag` = 0
AND `smedia_sereqid` = '51'
---
    public function fetch_job_list($tokendata)
    {

        $serequestModel = new ServiceRequestMasterModel();
        $serviceRequestMediaModel =  new ServiceRequestMediaModel();
        $servicerequestitemsModels = new ServiceRequestItemsModel();

        $services = $servicerequestitemsModels->where('sitem_deleteflag', 0)
            ->where('sitem_assignee_type', 1)
            ->where('sitem_assignee', $tokendata['uid'])
            ->join('servicerequest_master', 'serm_id=sitem_serid')
            ->join('customer_master', 'cstm_id=serm_custid')
            ->join('customer_vehicle', 'custveh_id =serm_vehid')
            ->join('cat_vehicle_data', 'id=custveh_veh_id')
            ->join('status_master', 'sm_id=serm_status')
            ->orderBy('sitem_id', 'DESC')
            ->findAll();

        if (sizeof($services) > 0) {

            for ($i = 0; $i < sizeof($services); $i++) {
                $services[$i]['medias'] = $serviceRequestMediaModel
                    ->where('smedia_deleteflag', 0)
                    ->where('smedia_sereqid', $services[$i]['serm_id'])->findAll();