app/Controllers/Approval/ApprovalmasterControler.php

    public function app_service()
    {

        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }


        $approvalModel = new ApprovalmasterModel();
        $resultworks = $approvalModel->where('am_deleteflag', 0)
            ->where('am_type', 4)
            ->Orwhere('am_type', 6)
            ->join('servicerequest_master', 'serm_id=am_reqid')
            ->join('customer_master', 'cstm_id=am_requestedby', 'left')
            ->join('users', 'us_id=am_createdby', 'left')
            ->orderBy('am_id', 'desc')
            ->findAll();



        $resultjobs = $approvalModel->where('am_deleteflag', 0)
            ->where('am_type', 5)
            ->Orwhere('am_type', 7)
            ->join('servicerequest_items', 'sitem_id=am_reqid')
            ->join('servicerequest_master', 'serm_id=sitem_serid')
            ->join('service_request_package', 'servpack_id=am_referenceid')
            ->join('customer_master', 'cstm_id=am_requestedby', 'left')
            ->join('users', 'us_id=am_createdby', 'left')
            ->orderBy('am_id', 'desc')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `approvalmaster`
JOIN `servicerequest_master` ON `serm_id`=`am_reqid`
LEFT JOIN `customer_master` ON `cstm_id`=`am_requestedby`
LEFT JOIN `users` ON `us_id`=`am_createdby`
WHERE `am_deleteflag` = 0
AND `am_type` = 4
OR `am_type` = 6
ORDER BY `am_id` DESC
SELECT *
FROM `approvalmaster`
JOIN `servicerequest_items` ON `sitem_id`=`am_reqid`
JOIN `servicerequest_master` ON `serm_id`=`sitem_serid`
JOIN `service_request_package` ON `servpack_id`=`am_referenceid`
LEFT JOIN `customer_master` ON `cstm_id`=`am_requestedby`
LEFT JOIN `users` ON `us_id`=`am_createdby`
WHERE `am_deleteflag` = 0
AND `am_type` = 5
OR `am_type` = 7
ORDER BY `am_id` DESC