app/Controllers/ToolRequest/ToolRequestMasterController.php

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function tool_req_list()
    {

        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `request_payment_tracker`
WHERE `rpt_type` = 0
AND `rpt_reqt_id` = '19'
 LIMIT 1
---

                }

                $pay_data[$i] = $paymentTrackerModel->where('rpt_type', 0)->where('rpt_reqt_id', $result[$i]['tldet_id'])->first();