app/Controllers/ServiceRequest/ServiceRequestMasterController.php

    public function index()
{
    $validModel = new Validation();
    $commonutils = new Commonutils();
    $heddata = $this->request->headers();
    $token = $validModel->getbearertoken($heddata['Authorization']);
    $tokendata = $commonutils->decode_jwt_token($token);

    if ($tokendata['aud'] == 'customer') {
        $custModel = new CustomerMasterModel();
        $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
        if (!$customer) return $this->fail("invalid user", 400);
    } elseif ($tokendata['aud'] == 'user') {
        $userModel = new UsersModel();
        $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
        if (!$users) return $this->fail("invalid user", 400);
    } else {
        return $this->fail("invalid user", 400);
    }

    $serequestModel = new ServiceRequestMasterModel();
    $quotemasterModel = new QuoteMasterModel();
    $vendorMasterModel = new VendorModel();

    // Optimize the main query to fetch all needed data
    $result = $serequestModel->select('serm_id, cstm_name, cstm_vendor_flag, cstm_id, custveh_regnumber, custveh_vinnumber, custveh_datacard_url, custveh_veh_id, make_name, model_name, variant_name, sm_name, sm_code, sm_pk_id, serm_status, serm_number, serm_id, serm_updatedon, serm_hold_flag, serm_cost, serm_vendor_flag')
        ->join('customer_master', 'cstm_id=serm_custid', 'left')
        ->join('customer_vehicle', 'custveh_id = serm_vehid', 'left')
        ->join('cat_vehicle_data', 'id=custveh_veh_id', 'left')
        ->join('status_master', 'sm_id=serm_status', 'left')
        ->join('users', 'us_id=serm_createdby', 'left')
        ->where('serm_deleteflag', 0)
        ->where('serm_active_flag', 0)
        ->where('serm_status!=', 34)
        ->where('serm_status!=', 32)
        ->orderBy('serm_number', 'DESC')
        ->findAll();
---
SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1
SELECT `serm_id`, `cstm_name`, `cstm_vendor_flag`, `cstm_id`, `custveh_regnumber`, `custveh_vinnumber`, `custveh_datacard_url`, `custveh_veh_id`, `make_name`, `model_name`, `variant_name`, `sm_name`, `sm_code`, `sm_pk_id`, `serm_status`, `serm_number`, `serm_id`, `serm_updatedon`, `serm_hold_flag`, `serm_cost`, `serm_vendor_flag`
FROM `servicerequest_master`
LEFT JOIN `customer_master` ON `cstm_id`=`serm_custid`
LEFT JOIN `customer_vehicle` ON `custveh_id` = `serm_vehid`
LEFT JOIN `cat_vehicle_data` ON `id`=`custveh_veh_id`
LEFT JOIN `status_master` ON `sm_id`=`serm_status`
LEFT JOIN `users` ON `us_id`=`serm_createdby`
WHERE `serm_deleteflag` = 0
AND `serm_active_flag` = 0
AND `serm_status` != 34
AND `serm_status` != 32
ORDER BY `serm_number` DESC

    public function show($id = null)
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $custModel = new CustomerMasterModel();
        $userModel = new UsersModel();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {

            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {

            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
---
SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `users`
WHERE `us_id` = '1'
AND `us_delete_flag` = 0
 LIMIT 1

            $result['days_left_to_reopen'] = 0;
            if ($result['serm_wkc_date'] != null && $result['serm_reopen_flag'] == 0) {

                $reopen_days = $workcardsettingsModel->select('ws_rp_days')->where('ws_delete_flag', 0)->first();
---
SELECT `ws_rp_days`
FROM `workcard_settings`
WHERE `ws_delete_flag` = 0
 LIMIT 1




            $rpt_data = $paymenttrackerModel->where('rpt_type', 1)->where('rpt_reqt_id', base64_decode($id))->first();
---
SELECT *
FROM `request_payment_tracker`
WHERE `rpt_type` = 1
AND `rpt_reqt_id` = '45'
 LIMIT 1



            $approvalmasterModel = new ApprovalmasterModel();
            $app_Data_work = $approvalmasterModel
                ->where('am_reqid', base64_decode($id))
                ->whereIn('am_type', [4, 6])
                ->orderBy('am_id', 'desc')
                ->first();
---
SELECT *
FROM `approvalmaster`
WHERE `am_reqid` = '45'
AND `am_type` IN (4,6)
ORDER BY `am_id` DESC
 LIMIT 1

            if (!$app_Data_work) {
                $app_Data_work = 0;
            }
            $quote_data = $quotemasterModel->where('qtm_type', 0)->Where('qtm_serm_id', $result['serm_id'])->first();
---
SELECT *
FROM `quote_master`
WHERE `qtm_type` = 0
AND `qtm_serm_id` = '45'
 LIMIT 1

                        if($services[$i]['sitem_assignee_type'] == 1){
                            $data = $servicepackageModel->where('servpack_id', $services[$i]['sitem_itemid'])
                            ->first();
                            $sitemAssign = $CustomerMasterModel->select('customer_master.cstm_name as sitem_assign')
                            ->where('cstm_id', $services[$i]['sitem_assignee'])
                            ->first();
---
SELECT `customer_master`.`cstm_name` as `sitem_assign`
FROM `customer_master`
WHERE `cstm_id` = '2'
 LIMIT 1


                if ($result['serm_vendor_flag'] == 0) {

                    $det = $UsersModel->where('us_id', $result['serm_assigne'])->first();
---
SELECT *
FROM `users`
WHERE `us_id` = '16'
 LIMIT 1


        for ($i = 0; $i < sizeof($packages); $i++) {
            $map_d = [];
            $map_d = $servicesmappingModel->where('srm_delete_flag', 0)
                ->where('srm_servpack_id', $packages[$i]['servpack_id'])
                ->join('tool_details', 'tool_id=srm_tool_id')
                ->findAll();
---
SELECT *
FROM `services_mapping`
JOIN `tool_details` ON `tool_id`=`srm_tool_id`
WHERE `srm_delete_flag` = 0
AND `srm_servpack_id` = '2'

    public function vehicle_make_list()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
---
SELECT *
FROM `users`
WHERE `us_id` = '20'
AND `us_delete_flag` = 0
 LIMIT 1

    public function service_requestbycustomer()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
---
SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1

        $requestdata = [];
        if (sizeof($result) > 0) {
            foreach ($result as $eachdata) {
                $eachdata['medias'] = $serviceRequestMediaModel->where('smedia_deleteflag', 0)->where('smedia_sereqid', $eachdata['serm_id'])->findAll();
---
SELECT *
FROM `servicerequest_media`
WHERE `smedia_deleteflag` = 0
AND `smedia_sereqid` = '104'

    public function serv_history_byid()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }
        $servicehistoryModel = new ServiceRequestHistoryModel();
        $servicequestModel = new ServiceRequestMasterModel();

        $result = $servicequestModel
            ->where('serm_id', $this->request->getVar('serm_id'))
            ->join('status_master', 'sm_id=serm_status')
            ->first();
---
SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `servicerequest_master`
JOIN `status_master` ON `sm_id`=`serm_status`
WHERE `serm_id` = '99'
 LIMIT 1

    public function completed_requestbyid()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $custModel = new CustomerMasterModel();
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();
            if (!$customer) return $this->fail("invalid user", 400);
        } else if ($tokendata['aud'] == 'user') {
            $userModel = new UsersModel();
            $users = $userModel->where("us_id", $tokendata['uid'])->where("us_delete_flag", 0)->first();
            if (!$users) return $this->fail("invalid user", 400);
        } else {
            return $this->fail("invalid user", 400);
        }
        $servicerequestMasterModel = new ServiceRequestMasterModel();
        $serm_req = $servicerequestMasterModel
            ->where('serm_custid', $tokendata['uid'])
            ->where('serm_status', 32)
            ->orwhere('serm_status', 34)
            ->join('customer_vehicle', 'custveh_id =serm_vehid')
            ->join('cat_vehicle_data', 'id=custveh_veh_id')
            ->orderBy('serm_id', 'desc')->findAll();
---
SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
SELECT *
FROM `servicerequest_master`
JOIN `customer_vehicle` ON `custveh_id` =`serm_vehid`
JOIN `cat_vehicle_data` ON `id`=`custveh_veh_id`
WHERE `serm_custid` = '1'
AND `serm_status` = 32
OR `serm_status` = 34
ORDER BY `serm_id` DESC