app/Controllers/Chat/ChatMasterController.php

SELECT *
FROM `customer_master`
WHERE `cstm_id` = '1'
AND `cstm_delete_flag` = 0
 LIMIT 1
---
    public function get_chat_history()
    {
        $validModel = new Validation();
        $commonutils = new Commonutils();
        $custModel = new CustomerMasterModel();
        $userModel = new UsersModel();

        $heddata = $this->request->headers();
        $tokendata = $commonutils->decode_jwt_token($validModel->getbearertoken($heddata['Authorization']));
        if ($tokendata['aud'] == 'customer') {
            $customer = $custModel->where("cstm_id", $tokendata['uid'])->where("cstm_delete_flag", 0)->first();

SELECT *
FROM `chat_details`
LEFT JOIN `customer_master` ON `cstm_id`=`c_customer_id`
LEFT JOIN `users` ON `us_id`=`c_staff_id`
WHERE `c_customer_id` = '1'
---
        ->join('customer_master','cstm_id=c_customer_id','left')
        ->join('users','us_id=c_staff_id','left')
        ->findAll():
        $chatdetailsModel->where('c_customer_id',$this->request->getVar('c_customer_id'))